nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
bool link_shell_msleep_notifications_subscribed;

static void link_shell_print_usage(struct link_shell_cmd_args_t *link_cmd_args)
{
	switch (link_cmd_args->command) {
	case LINK_CMD_SETTINGS:
		mosh_print_no_format(link_settings_usage_str);
		break;
	case LINK_CMD_DEFCONT:
		mosh_print_no_format(link_defcont_usage_str);
		break;
	case LINK_CMD_DEFCONTAUTH:
		mosh_print_no_format(link_defcontauth_usage_str);
		break;
	case LINK_CMD_CONNECT:
	case LINK_CMD_DISCONNECT:
		mosh_print_no_format(link_connect_usage_str);
		break;
	case LINK_CMD_SYSMODE:
		mosh_print_no_format(link_sysmode_usage_str);
		break;
	case LINK_CMD_FUNMODE:
		mosh_print_no_format(link_funmode_usage_str);
		break;
	case LINK_CMD_NORMAL_MODE_AT:
		mosh_print_no_format(link_normal_mode_at_usage_str);
		break;
	case LINK_CMD_NORMAL_MODE_AUTO:
		mosh_print_no_format(link_normal_mode_auto_usage_str);
		break;
	case LINK_CMD_EDRX:
		mosh_print_no_format(link_edrx_usage_str);
		break;
	case LINK_CMD_PSM:
		mosh_print_no_format(link_psm_usage_str);
		break;
	case LINK_CMD_RSRP:
		mosh_print_no_format(link_rsrp_usage_str);
		break;
	case LINK_CMD_SEARCH:
		mosh_print_no_format(link_search_usage_str);
		break;
	case LINK_CMD_NCELLMEAS:
		mosh_print_no_format(link_ncellmeas_usage_str);
		break;
	case LINK_CMD_MDMSLEEP:
		mosh_print_no_format(link_msleep_usage_str);
		break;
	case LINK_CMD_TAU:
		mosh_print_no_format(link_tau_usage_str);
		break;
	case LINK_CMD_RAI:
		mosh_print_no_format(link_rai_usage_str);
		break;
	case LINK_CMD_DNSADDR:
		mosh_print_no_format(link_dnsaddr_usage_str);
		break;
	case LINK_CMD_REDMOB:
		mosh_print_no_format(link_redmob_usage_str);
		break;
	default:
		mosh_print_no_format(link_usage_str);
		break;
	}
}

static void link_shell_cmd_defaults_set(struct link_shell_cmd_args_t *link_cmd_args)
{
	memset(link_cmd_args, 0, sizeof(struct link_shell_cmd_args_t));
	link_cmd_args->funmode_option = LINK_FUNMODE_NONE;
	link_cmd_args->sysmode_option = LTE_LC_SYSTEM_MODE_NONE;
	link_cmd_args->sysmode_lte_pref_option =
		LTE_LC_SYSTEM_MODE_PREFER_AUTO;
	link_cmd_args->lte_mode = LTE_LC_LTE_MODE_NONE;
	link_cmd_args->common_option = LINK_COMMON_NONE;
	link_cmd_args->mreset_type = LTE_LC_FACTORY_RESET_INVALID;
	link_cmd_args->ncellmeasmode = LINK_NCELLMEAS_MODE_NONE;
	link_cmd_args->ncellmeas_search_type = LTE_LC_NEIGHBOR_SEARCH_TYPE_DEFAULT;
	link_cmd_args->redmob_mode = LINK_REDMOB_NONE;
}

/******************************************************************************/

/* From lte_lc.c, and TODO: to be updated if something is added */
#define SYS_MODE_PREFERRED					   \
	(IS_ENABLED(CONFIG_LTE_NETWORK_MODE_LTE_M)              ?  \
	 LTE_LC_SYSTEM_MODE_LTEM                         :	   \
	 IS_ENABLED(CONFIG_LTE_NETWORK_MODE_NBIOT)               ? \
	 LTE_LC_SYSTEM_MODE_NBIOT                        :	   \
	 IS_ENABLED(CONFIG_LTE_NETWORK_MODE_LTE_M_GPS)           ? \
	 LTE_LC_SYSTEM_MODE_LTEM_GPS                     :	   \
	 IS_ENABLED(CONFIG_LTE_NETWORK_MODE_NBIOT_GPS)           ? \
	 LTE_LC_SYSTEM_MODE_NBIOT_GPS                    :	   \
	 IS_ENABLED(CONFIG_LTE_NETWORK_MODE_LTE_M_NBIOT)         ? \
	 LTE_LC_SYSTEM_MODE_LTEM_NBIOT                   :	   \
	 IS_ENABLED(CONFIG_LTE_NETWORK_MODE_LTE_M_NBIOT_GPS)     ? \
	 LTE_LC_SYSTEM_MODE_LTEM_NBIOT_GPS               :	   \
	 LTE_LC_SYSTEM_MODE_NONE)

static void link_shell_sysmode_set(int sysmode, int lte_pref)
{
	enum lte_lc_func_mode functional_mode;
	char snum[64];
	int ret = lte_lc_system_mode_set(sysmode, lte_pref);

	if (ret < 0) {
		mosh_error("Cannot set system mode to modem: %d", ret);
		ret = lte_lc_func_mode_get(&functional_mode);
		if (ret == 0 &&
		    (functional_mode != LTE_LC_FUNC_MODE_OFFLINE &&
		     functional_mode != LTE_LC_FUNC_MODE_POWER_OFF)) {
			mosh_warn(
				"Requested mode couldn't set to modem. "
				"Not in flighmode nor in pwroff?");
		}
	} else {
		mosh_print(
			"System mode set successfully to modem: %s",
			link_shell_sysmode_to_string(sysmode, snum));
	}
}

/******************************************************************************/

#define MOSH_NCELLMEAS_SEARCH_TYPE_NONE 0xFF

static enum lte_lc_neighbor_search_type
	link_shell_string_to_ncellmeas_search_type(const char *search_type_str)
{
	enum lte_lc_neighbor_search_type search_type = MOSH_NCELLMEAS_SEARCH_TYPE_NONE;

	if (strcmp(search_type_str, "default") == 0) {
		search_type = LTE_LC_NEIGHBOR_SEARCH_TYPE_DEFAULT;
	} else if (strcmp(search_type_str, "ext_light") == 0) {
		search_type = LTE_LC_NEIGHBOR_SEARCH_TYPE_EXTENDED_LIGHT;
	} else if (strcmp(search_type_str, "ext_comp") == 0) {
		search_type = LTE_LC_NEIGHBOR_SEARCH_TYPE_EXTENDED_COMPLETE;
	}

	return search_type;
}

/******************************************************************************/

int link_shell_get_and_print_current_system_modes(
	enum lte_lc_system_mode *sys_mode_current,
	enum lte_lc_system_mode_preference *sys_mode_preferred,
	enum lte_lc_lte_mode *currently_active_mode)
{
	int ret = -1;

	char snum[64];

	ret = lte_lc_system_mode_get(sys_mode_current, sys_mode_preferred);
	if (ret >= 0) {
		mosh_print(
			"Modem config for system mode: %s",
			link_shell_sysmode_to_string(*sys_mode_current, snum));
		mosh_print(
			"Modem config for LTE preference: %s",
			link_shell_sysmode_preferred_to_string(*sys_mode_preferred, snum));
	} else {
		return ret;
	}

	ret = lte_lc_lte_mode_get(currently_active_mode);
	if (ret >= 0) {
		mosh_print(
			"Currently active system mode: %s",
			link_shell_sysmode_currently_active_to_string(
				*currently_active_mode, snum));
	}
	return ret;
}

int link_shell(const struct shell *shell, size_t argc, char **argv)
{
	struct link_shell_cmd_args_t link_cmd_args;
	int ret = 0;
	bool require_apn = false;
	bool require_pdn_cid = false;
	bool require_subscribe = false;
	bool require_option = false;
	bool nmode_use_rel14 = true;
	char *apn = NULL;
	char *family = NULL;
	char *ip_address = NULL;
	int protocol = 0;
	bool protocol_given = false;
	char *username = NULL;
	char *password = NULL;
	int pdn_cid = 0;
	int threshold_time = 0;
	int periodic_time = 0;

	struct lte_lc_periodic_search_cfg search_cfg = { 0 };
	bool search_cfg_given = false;

	link_shell_cmd_defaults_set(&link_cmd_args);

	if (argc < 2) {
		goto show_usage;
	}

