nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
	/* command = argv[0] = "link" */
	/* sub-command = argv[1]       */
	if (strcmp(argv[1], "status") == 0) {
		link_cmd_args.command = LINK_CMD_STATUS;
	} else if (strcmp(argv[1], "settings") == 0) {
		link_cmd_args.command = LINK_CMD_SETTINGS;
	} else if (strcmp(argv[1], "coneval") == 0) {
		link_cmd_args.command = LINK_CMD_CONEVAL;
	} else if (strcmp(argv[1], "rsrp") == 0) {
		require_subscribe = true;
		link_cmd_args.command = LINK_CMD_RSRP;
	} else if (strcmp(argv[1], "search") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_SEARCH;
	} else if (strcmp(argv[1], "ncellmeas") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_NCELLMEAS;
	} else if (strcmp(argv[1], "msleep") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_MDMSLEEP;
	} else if (strcmp(argv[1], "tau") == 0) {
		require_subscribe = true;
		link_cmd_args.command = LINK_CMD_TAU;
	} else if (strcmp(argv[1], "connect") == 0) {
		require_apn = true;
		link_cmd_args.command = LINK_CMD_CONNECT;
	} else if (strcmp(argv[1], "disconnect") == 0) {
		require_pdn_cid = true;
		link_cmd_args.command = LINK_CMD_DISCONNECT;
	} else if (strcmp(argv[1], "defcont") == 0) {
		link_cmd_args.command = LINK_CMD_DEFCONT;
	} else if (strcmp(argv[1], "defcontauth") == 0) {
		link_cmd_args.command = LINK_CMD_DEFCONTAUTH;
	} else if (strcmp(argv[1], "funmode") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_FUNMODE;
	} else if (strcmp(argv[1], "sysmode") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_SYSMODE;
	} else if (strcmp(argv[1], "nmodeat") == 0) {
		link_cmd_args.command = LINK_CMD_NORMAL_MODE_AT;
	} else if (strcmp(argv[1], "nmodeauto") == 0) {
		link_cmd_args.command = LINK_CMD_NORMAL_MODE_AUTO;
	} else if (strcmp(argv[1], "edrx") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_EDRX;
	} else if (strcmp(argv[1], "psm") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_PSM;
	} else if (strcmp(argv[1], "rai") == 0) {
		require_option = true;
		link_cmd_args.command = LINK_CMD_RAI;
	} else if (strcmp(argv[1], "dnsaddr") == 0) {
		link_cmd_args.command = LINK_CMD_DNSADDR;
	} else if (strcmp(argv[1], "redmob") == 0) {
		link_cmd_args.command = LINK_CMD_REDMOB;
	} else {
		mosh_error("Unsupported command=%s\n", argv[1]);
		ret = -EINVAL;
		goto show_usage;
	}

	/* Reset getopt due to possible previous failures: */
	optreset = 1;

	/* We start from subcmd arguments */
	optind = 2;

	int long_index = 0;
	int opt;
	int apn_len = 0;

	char edrx_value_str[LINK_SHELL_EDRX_VALUE_STR_LENGTH + 1];
	bool edrx_value_set = false;
	char edrx_ptw_bit_str[LINK_SHELL_EDRX_PTW_STR_LENGTH + 1];
	bool edrx_ptw_set = false;

	char psm_rptau_bit_str[LINK_SHELL_PSM_PARAM_STR_LENGTH + 1];
	bool psm_rptau_set = false;
	char psm_rat_bit_str[LINK_SHELL_PSM_PARAM_STR_LENGTH + 1];
	bool psm_rat_set = false;

	char *normal_mode_at_str = NULL;
	uint8_t normal_mode_at_mem_slot = 0;

	while ((opt = getopt_long(argc, argv,
				  "a:I:f:i:x:w:p:t:A:P:U:su014rmngMNed",
				  long_options, &long_index)) != -1) {
		switch (opt) {
		/* RSRP: */
		case 's':
			link_cmd_args.common_option = LINK_COMMON_SUBSCRIBE;
			break;
		case 'u':
			link_cmd_args.common_option = LINK_COMMON_UNSUBSCRIBE;
			break;

		/* Modem functional modes: */
		case '0':
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_POWER_OFF;
			break;
		case '1':
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_NORMAL;
			break;
		case '4':
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_OFFLINE;
			break;
		case LINK_SHELL_OPT_FUNMODE_LTEOFF:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_DEACTIVATE_LTE;
			break;
		case LINK_SHELL_OPT_FUNMODE_LTEON:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_ACTIVATE_LTE;
			break;
		case LINK_SHELL_OPT_FUNMODE_GNSSOFF:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_DEACTIVATE_GNSS;
			break;
		case LINK_SHELL_OPT_FUNMODE_GNSSON:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_ACTIVATE_GNSS;
			break;
		case LINK_SHELL_OPT_FUNMODE_UICCOFF:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_DEACTIVATE_UICC;
			break;
		case LINK_SHELL_OPT_FUNMODE_UICCON:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_ACTIVATE_UICC;
			break;
		case LINK_SHELL_OPT_FUNMODE_FLIGHTMODE_UICCON:
			link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_OFFLINE_UICC_ON;
			break;

		/* eDRX specifics: */
		case 'x': /* drx_value */
			if (strlen(optarg) == LINK_SHELL_EDRX_VALUE_STR_LENGTH) {
				strcpy(edrx_value_str, optarg);
				edrx_value_set = true;
			} else {
				mosh_error(
					"eDRX value string length must be %d.",
					LINK_SHELL_EDRX_VALUE_STR_LENGTH);
				return -EINVAL;
			}
			break;
		case 'w': /* Paging Time Window */
			if (strlen(optarg) == LINK_SHELL_EDRX_PTW_STR_LENGTH) {
				strcpy(edrx_ptw_bit_str, optarg);
				edrx_ptw_set = true;
			} else {
				mosh_error(
					"PTW string length must be %d.",
					LINK_SHELL_EDRX_PTW_STR_LENGTH);
				return -EINVAL;
			}
			break;

		/* PSM specifics: */
		case 'p': /* rptau */
			if (strlen(optarg) == LINK_SHELL_PSM_PARAM_STR_LENGTH) {
				strcpy(psm_rptau_bit_str, optarg);
				psm_rptau_set = true;
			} else {
				mosh_error(
					"RPTAU bit string length must be %d.",
					LINK_SHELL_PSM_PARAM_STR_LENGTH);
				return -EINVAL;
			}
			break;
		case 't': /* rat */
			if (strlen(optarg) == LINK_SHELL_PSM_PARAM_STR_LENGTH) {
				strcpy(psm_rat_bit_str, optarg);
				psm_rat_set = true;
			} else {
				mosh_error(
					"RAT bit string length must be %d.",
					LINK_SHELL_PSM_PARAM_STR_LENGTH);
				return -EINVAL;
			}
			break;

		/* Modem system modes: */
		case 'm':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_LTEM;
			link_cmd_args.lte_mode = LTE_LC_LTE_MODE_LTEM;
			break;
		case 'n':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_NBIOT;
			link_cmd_args.lte_mode = LTE_LC_LTE_MODE_NBIOT;
			break;
		case 'g':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_GPS;
			break;
		case 'M':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_LTEM_GPS;
			break;
		case 'N':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_NBIOT_GPS;
			break;

		/* Common options: */
		case 'e':
			link_cmd_args.common_option = LINK_COMMON_ENABLE;
			break;
		case 'd':
			link_cmd_args.common_option = LINK_COMMON_DISABLE;
			break;
		case 'r':
			link_cmd_args.common_option = LINK_COMMON_READ;
			break;
		case 'I': /* PDN CID */
			pdn_cid = atoi(optarg);
			if (pdn_cid <= 0) {
				mosh_error(
					"PDN CID (%d) must be positive integer. "
					"Default PDN context (CID=0) cannot be given.",
					pdn_cid);
				return -EINVAL;
			}
			break;
		case 'a': /* APN */
			apn_len = strlen(optarg);
			if (apn_len > LINK_APN_STR_MAX_LENGTH) {
				mosh_error(
					"APN string length %d exceeded. Maximum is %d.",
					apn_len, LINK_APN_STR_MAX_LENGTH);
				return -EINVAL;
			}
			apn = optarg;
			break;
		case 'f': /* Address family */
			family = optarg;
			break;
		case 'i': /* IP address */
			ip_address = optarg;
			break;
		case 'A': /* auth protocol */
			protocol = atoi(optarg);
			protocol_given = true;
			break;
		case 'U': /* auth username */
			username = optarg;
			break;
		case 'P': /* auth password */
			password = optarg;
			break;
		/* Options without short option: */
		case LINK_SHELL_OPT_SINGLE:
			link_cmd_args.ncellmeasmode = LINK_NCELLMEAS_MODE_SINGLE;
			break;
		case LINK_SHELL_OPT_CONTINUOUS:
			link_cmd_args.ncellmeasmode = LINK_NCELLMEAS_MODE_CONTINUOUS;
			break;
		case LINK_SHELL_OPT_NCELLMEAS_SEARCH_TYPE:
			link_cmd_args.ncellmeas_search_type =
				link_shell_string_to_ncellmeas_search_type(optarg);
			if (link_cmd_args.ncellmeas_search_type ==
			    MOSH_NCELLMEAS_SEARCH_TYPE_NONE) {
				mosh_error("Unknown search_type. See usage:");
				goto show_usage;
			}
			break;
		case LINK_SHELL_OPT_SEARCH_CFG: {
			int loop_integer = 0;

