nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
	char snum[64];

	switch (link_cmd_args.command) {
	case LINK_CMD_DEFCONT:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_defcont_conf_shell_print();
		} else if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_sett_save_defcont_enabled(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			if (nrf_modem_at_printf("AT+CGDCONT=0") != 0) {
				mosh_warn(
					"ERROR from modem. Getting the initial PDP context back "
					"wasn't successful.");
			}
			link_sett_save_defcont_enabled(false);
			mosh_print("Custom default context config disabled.");
		} else if (link_cmd_args.common_option == LINK_COMMON_NONE &&
			   apn == NULL && family == NULL) {
			goto show_usage;
		}
		if (apn != NULL) {
			(void)link_sett_save_defcont_apn(apn);
		}
		if (family != NULL) {
			enum pdn_fam pdn_lib_fam;

			ret = link_family_str_to_pdn_lib_family(&pdn_lib_fam,
								 family);
			if (ret) {
				mosh_error("Unknown PDN family %s", family);
				goto show_usage;
			} else {
				(void)link_sett_save_defcont_pdn_family(
					pdn_lib_fam);
			}
		}
		break;
	case LINK_CMD_DEFCONTAUTH:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_defcontauth_conf_shell_print();
		} else if (link_cmd_args.common_option ==
			   LINK_COMMON_ENABLE) {
			if (link_sett_save_defcontauth_enabled(true) < 0) {
				mosh_warn("Cannot enable authentication.");
			}
		} else if (link_cmd_args.common_option ==
			   LINK_COMMON_DISABLE) {
			if (nrf_modem_at_printf("AT+CGAUTH=0,0") != 0) {
				mosh_warn("Disabling of auth cannot be done to modem.");
			}
			link_sett_save_defcontauth_enabled(false);
		} else if (link_cmd_args.common_option == LINK_COMMON_NONE &&
			   !protocol_given && username == NULL &&
			   password == NULL) {
			goto show_usage;
		}

		if (protocol_given) {
			(void)link_sett_save_defcontauth_prot(protocol);
		}
		if (username != NULL) {
			(void)link_sett_save_defcontauth_username(username);
		}
		if (password != NULL) {
			(void)link_sett_save_defcontauth_password(password);
		}
		break;

	case LINK_CMD_STATUS: {
		enum lte_lc_nw_reg_status current_reg_status;
		enum lte_lc_func_mode functional_mode;
		bool connected = false;

		ret = lte_lc_func_mode_get(&functional_mode);
		if (ret) {
			mosh_warn("Cannot get functional mode from modem: %d", ret);
		} else {
			mosh_print(
				"Modem functional mode: %s",
				link_shell_funmode_to_string(functional_mode, snum));
		}
		ret = lte_lc_nw_reg_status_get(&current_reg_status);
		if (ret >= 0) {
			link_shell_print_reg_status(current_reg_status);
		} else {
			mosh_error("Cannot get current registration status (%d)", ret);
		}
		if (current_reg_status == LTE_LC_NW_REG_REGISTERED_EMERGENCY ||
		    current_reg_status == LTE_LC_NW_REG_REGISTERED_HOME ||
		    current_reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING) {
			connected = true;
		}

		link_api_modem_info_get_for_shell(connected);
		break;
	}
	case LINK_CMD_SETTINGS:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_all_print();
		} else if (link_cmd_args.common_option == LINK_COMMON_RESET ||
			   link_cmd_args.mreset_type != LTE_LC_FACTORY_RESET_INVALID) {
			if (link_cmd_args.common_option == LINK_COMMON_RESET) {
				link_sett_defaults_set();
				link_shell_sysmode_set(SYS_MODE_PREFERRED,
						       CONFIG_LTE_MODE_PREFERENCE);
			}
			if (link_cmd_args.mreset_type == LTE_LC_FACTORY_RESET_ALL) {
				link_sett_modem_factory_reset(LTE_LC_FACTORY_RESET_ALL);
			} else if (link_cmd_args.mreset_type == LTE_LC_FACTORY_RESET_USER) {
				link_sett_modem_factory_reset(LTE_LC_FACTORY_RESET_USER);
			}
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_CONEVAL:
		link_api_coneval_read_for_shell();
		break;

	case LINK_CMD_REDMOB:
		if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_cmd_args.redmob_mode = LTE_LC_REDUCED_MOBILITY_DISABLED;
		}
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			enum lte_lc_reduced_mobility_mode mode;

			ret = lte_lc_reduced_mobility_get(&mode);
			if (ret) {
				mosh_error("Cannot get reduced mobility mode: %d", ret);
			} else {
				mosh_print(
					"Reduced mobility mode read successfully: %s",
					link_shell_redmob_mode_to_string(mode, snum));
			}
		} else if (link_cmd_args.redmob_mode != LINK_REDMOB_NONE) {
			ret = lte_lc_reduced_mobility_set(link_cmd_args.redmob_mode);
			if (ret) {
				mosh_error("Cannot set reduced mobility mode: %d", ret);
			} else {
				mosh_print(
					"Reduced mobility mode set successfully: %s",
					link_shell_redmob_mode_to_string(
						link_cmd_args.redmob_mode, snum));
			}
		} else {
			goto show_usage;
		}
		break;

	case LINK_CMD_SYSMODE:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			enum lte_lc_system_mode sys_mode_current;
			enum lte_lc_system_mode_preference sys_mode_pref_current;
			enum lte_lc_lte_mode currently_active_mode;

			ret = link_shell_get_and_print_current_system_modes(
				&sys_mode_current, &sys_mode_pref_current, &currently_active_mode);
			if (ret < 0) {
				mosh_error("Cannot read system mode of the modem: %d", ret);
			} else {
				enum lte_lc_system_mode sett_sys_mode;
				enum lte_lc_system_mode_preference sett_lte_pref;

				/* Print also settings stored in mosh side: */
				link_sett_sysmode_print();
				sett_sys_mode = link_sett_sysmode_get();
				sett_lte_pref =
					link_sett_sysmode_lte_preference_get();
				if (sett_sys_mode != LTE_LC_SYSTEM_MODE_NONE &&
				    sett_sys_mode != sys_mode_current &&
				    sett_lte_pref != sys_mode_pref_current) {
					mosh_warn(
						"note: seems that set link sysmode and "
						"counterparts in modem are not in sync");
					mosh_warn(
						"but no worries; requested system mode retried "
						"next time when going to normal mode");
				}
			}
		} else if (link_cmd_args.sysmode_option != LTE_LC_SYSTEM_MODE_NONE) {
			link_shell_sysmode_set(
				link_cmd_args.sysmode_option,
				link_cmd_args.sysmode_lte_pref_option);

			/* Save system modem to link settings: */
			(void)link_sett_sysmode_save(
				link_cmd_args.sysmode_option,
				link_cmd_args.sysmode_lte_pref_option);

