nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
		} else if (link_cmd_args.common_option == LINK_COMMON_RESET) {
			link_shell_sysmode_set(SYS_MODE_PREFERRED, CONFIG_LTE_MODE_PREFERENCE);

			(void)link_sett_sysmode_default_set();
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_FUNMODE:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			enum lte_lc_func_mode functional_mode;

			ret = lte_lc_func_mode_get(&functional_mode);
			if (ret) {
				mosh_error("Cannot get functional mode: %d", ret);
			} else {
				mosh_print(
					"Functional mode read successfully: %s",
					link_shell_funmode_to_string(functional_mode, snum));
			}
		} else if (link_cmd_args.funmode_option != LINK_FUNMODE_NONE) {
			ret = link_func_mode_set(link_cmd_args.funmode_option, nmode_use_rel14);
			if (ret < 0) {
				mosh_error("Cannot set functional mode: %d", ret);
			} else {
				mosh_print(
					"Functional mode set successfully: %s",
					link_shell_funmode_to_string(
						link_cmd_args.funmode_option, snum));
			}
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_NORMAL_MODE_AT:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_normal_mode_at_cmds_shell_print();
		} else if (normal_mode_at_str != NULL) {
			ret = link_sett_save_normal_mode_at_cmd_str(
				normal_mode_at_str, normal_mode_at_mem_slot);
			if (ret < 0) {
				mosh_error(
					"Cannot set normal mode AT-command: \"%s\"",
					normal_mode_at_str);
			} else {
				mosh_print(
					"Normal mode AT-command \"%s\" set successfully to "
					"memory slot %d.",
					((strlen(normal_mode_at_str)) ?
					 normal_mode_at_str :
					 "<empty>"),
					normal_mode_at_mem_slot);
			}
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_NORMAL_MODE_AUTO:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_normal_mode_autoconn_shell_print();
		} else if (link_cmd_args.common_option ==
			   LINK_COMMON_ENABLE) {
			link_sett_save_normal_mode_autoconn_enabled(true, nmode_use_rel14);
		} else if (link_cmd_args.common_option ==
			   LINK_COMMON_DISABLE) {
			link_sett_save_normal_mode_autoconn_enabled(false, nmode_use_rel14);
		} else {
			goto show_usage;
		}
		break;

	case LINK_CMD_EDRX:
		if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			char *value =
				NULL; /* Set with the defaults if not given */

			if (link_cmd_args.lte_mode == LTE_LC_LTE_MODE_NONE) {
				mosh_error("LTE mode is mandatory to be given. See usage:");
				goto show_usage;
			}

			if (edrx_value_set) {
				value = edrx_value_str;
			}

			ret = lte_lc_edrx_param_set(link_cmd_args.lte_mode,
						    value);
			if (ret < 0) {
				mosh_error(
					"Cannot set eDRX value %s, error: %d",
					((value == NULL) ? "NULL" : value),
					ret);
				return -EINVAL;
			}
			value = NULL; /* Set with the defaults if not given */
			if (edrx_ptw_set) {
				value = edrx_ptw_bit_str;
			}

			ret = lte_lc_ptw_set(link_cmd_args.lte_mode, value);
			if (ret < 0) {
				mosh_error(
					"Cannot set PTW value %s, error: %d",
					((value == NULL) ? "NULL" : value),
					ret);
				return -EINVAL;
			}

			ret = lte_lc_edrx_req(true);
			if (ret < 0) {
				mosh_error("Cannot enable eDRX: %d", ret);
			} else {
				mosh_print("eDRX enabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			ret = lte_lc_edrx_req(false);
			if (ret < 0) {
				mosh_error("Cannot disable eDRX: %d", ret);
			} else {
				mosh_print("eDRX disabled");
			}
		} else {
			mosh_error("Unknown option for edrx command. See usage:");
			goto show_usage;
		}
		break;
	case LINK_CMD_PSM:
		if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			/* Set with the defaults if not given */
			char *rptau_bit_value = NULL;
			char *rat_bit_value = NULL;

			if (psm_rptau_set) {
				rptau_bit_value = psm_rptau_bit_str;
			}

			if (psm_rat_set) {
				rat_bit_value = psm_rat_bit_str;
			}

			ret = lte_lc_psm_param_set(rptau_bit_value,
						   rat_bit_value);
			if (ret < 0) {
				mosh_error("Cannot set PSM parameters: error %d", ret);
				mosh_error(
					"  rptau %s, rat %s",
					((rptau_bit_value == NULL) ? "NULL" : rptau_bit_value),
					((rat_bit_value == NULL) ? "NULL" : rat_bit_value));
				return -EINVAL;
			}

			ret = lte_lc_psm_req(true);
			if (ret < 0) {
				mosh_error("Cannot enable PSM: %d", ret);
			} else {
				mosh_print("PSM enabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			ret = lte_lc_psm_req(false);
			if (ret < 0) {
				mosh_error("Cannot disable PSM: %d", ret);
			} else {
				mosh_print("PSM disabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_READ) {
			int tau, active_time;

			ret = lte_lc_psm_get(&tau, &active_time);
			if (ret < 0) {
				mosh_error("Cannot get PSM configs: %d", ret);
			} else {
				mosh_print(
					"PSM config: TAU %d %s, active time %d %s",
					tau,
					(tau == -1) ? "(timer deactivated)" :
					"seconds",
					active_time,
					(active_time == -1) ?
					"(timer deactivated)" :
					"seconds");
			}
		} else {
			mosh_error("Unknown option for psm command. See usage:");
			goto show_usage;
		}
		break;

	case LINK_CMD_RSRP:
		(link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) ?
		link_rsrp_subscribe(true) :
		link_rsrp_subscribe(false);
		break;
	case LINK_CMD_SEARCH:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {

			ret = lte_lc_periodic_search_get(&search_cfg);
			if (ret) {
				mosh_error("Reading search configuration failed: %d", ret);
			} else {
				mosh_print("Search configuration:");
				mosh_print("  Loop: %s", search_cfg.loop ? "True" : "False");
				mosh_print("  Return to pattern: %u", search_cfg.return_to_pattern);
				mosh_print("  Band optimization: %u", search_cfg.band_optimization);
				mosh_print("  Pattern count: %d", search_cfg.pattern_count);
				for (int i = 0; i < search_cfg.pattern_count; i++) {
					struct lte_lc_periodic_search_pattern *pattern =
						&search_cfg.patterns[i];
					mosh_print("  [%d] Type: %s", i,
						(pattern->type ==
						 LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE) ?
						"Range" : "Table");

					if (pattern->type == LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE) {
						mosh_print("  [%d] Initial sleep: %u", i,
							pattern->range.initial_sleep);
						mosh_print("  [%d] Final sleep: %u", i,
							pattern->range.final_sleep);
						mosh_print("  [%d] Time to final sleep: %d", i,
							pattern->range.time_to_final_sleep);
						mosh_print("  [%d] Pattern endpoint: %d", i,
							pattern->range.pattern_end_point);
					} else if (pattern->type ==
						   LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE) {
						mosh_print("  [%d] Value 1: %d", i,
							pattern->table.val_1);
						mosh_print("  [%d] Value 2: %d", i,
							pattern->table.val_2);
						mosh_print("  [%d] Value 3: %d", i,
							pattern->table.val_3);
						mosh_print("  [%d] Value 4: %d", i,
							pattern->table.val_4);
						mosh_print("  [%d] Value 5: %d", i,
							pattern->table.val_5);
					} else {
						mosh_error("Unknown pattern");
					}
				}
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_WRITE) {

			if (!search_cfg_given) {
				mosh_print(
					"No --search_cfg option given, "
					"using default configuration");

				/* Using search parameters for normal power level mentioned in
				 * https://infocenter.nordicsemi.com/index.jsp?topic=%2Fref_at_commands%2FREF%2Fat_commands%2Fnw_service%2Fperiodicsearchconf_set.html
				 */
				search_cfg.loop = false;
				search_cfg.return_to_pattern = 0;
				search_cfg.band_optimization = 1;
				search_cfg.pattern_count = 2;

				search_cfg.patterns[0].type = LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE;
				search_cfg.patterns[0].range.initial_sleep = 10;
				search_cfg.patterns[0].range.final_sleep = 40;
				search_cfg.patterns[0].range.time_to_final_sleep = 5;
				search_cfg.patterns[0].range.pattern_end_point = 15;

