nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
				search_cfg.patterns[1].type = LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE;
				search_cfg.patterns[1].table.val_1 = 60;
				search_cfg.patterns[1].table.val_2 = 90;
				search_cfg.patterns[1].table.val_3 = 300;
				search_cfg.patterns[1].table.val_4 = -1;
				search_cfg.patterns[1].table.val_5 = -1;

			} else if (search_cfg.pattern_count == 0) {
				mosh_error(
					"No --search_pattern_range or --search_pattern_table "
					"options given");
				return -EINVAL;
			}

			ret = lte_lc_periodic_search_set(&search_cfg);
			if (ret) {
				mosh_error("Writing search configuration failed: %d", ret);
			} else {
				mosh_print("Writing search configuration succeeded");
			}

		} else if (link_cmd_args.common_option == LINK_COMMON_START) {
			ret = lte_lc_periodic_search_request();
			if (ret) {
				mosh_error("Starting search failed: %d", ret);
			} else {
				mosh_print("Search requested");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_RESET) {
			ret = lte_lc_periodic_search_clear();
			if (ret) {
				mosh_error("Clearing search configuration failed: %d", ret);
			} else {
				mosh_print("Search configuration cleared");
			}
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_NCELLMEAS:
		if (link_cmd_args.common_option == LINK_COMMON_STOP) {
			link_ncellmeas_start(false,
					     LINK_NCELLMEAS_MODE_NONE,
					     LTE_LC_NEIGHBOR_SEARCH_TYPE_DEFAULT, 0);

		} else if (link_cmd_args.ncellmeasmode != LINK_NCELLMEAS_MODE_NONE) {
			mosh_print("Neighbor cell measurements and reporting starting");
			link_ncellmeas_start(true,
					     link_cmd_args.ncellmeasmode,
					     link_cmd_args.ncellmeas_search_type,
					     periodic_time);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_MDMSLEEP:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_sleep_notifications_subscribe(
				CONFIG_LTE_LC_MODEM_SLEEP_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_MODEM_SLEEP_NOTIFICATIONS_THRESHOLD_MS));
			link_shell_msleep_notifications_subscribed = true;
		} else {
			link_modem_sleep_notifications_unsubscribe();
			link_shell_msleep_notifications_subscribed = false;
		}
		break;
	case LINK_CMD_TAU:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_tau_notifications_subscribe(
				CONFIG_LTE_LC_TAU_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_TAU_PRE_WARNING_THRESHOLD_MS));
		} else {
			link_modem_tau_notifications_unsubscribe();
		}
		break;
	case LINK_CMD_CONNECT: {
		struct link_shell_pdn_auth auth_params;
		struct link_shell_pdn_auth *auth_params_ptr = NULL;

		if ((protocol_given &&
		     (username == NULL || password == NULL)) ||
		    ((username != NULL || password != NULL) &&
		     !protocol_given)) {
			mosh_error("When setting authentication, all auth options must be given");
			goto show_usage;
		} else {
			enum pdn_auth method;

			ret = link_shell_pdn_auth_prot_to_pdn_lib_method_map(
				protocol, &method);
			if (ret) {
				mosh_error("Unknown auth protocol %d", protocol);
				goto show_usage;
			}
			auth_params.method = method;
			auth_params.user = username;
			auth_params.password = password;
			if (protocol_given && username != NULL &&
			    password != NULL) {
				auth_params_ptr = &auth_params;
			}
		}
		ret = link_shell_pdn_connect(apn, family, auth_params_ptr);
	} break;
	case LINK_CMD_RAI:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_rai_read();
		} else if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_rai_enable(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_rai_enable(false);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_DNSADDR:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_dnsaddr_conf_shell_print();
			break;
		}

		if (ip_address && strlen(ip_address) > 0 &&
		    net_utils_ip_string_is_valid(ip_address) == false) {
			mosh_error("Invalid IP address: %s", ip_address);
			ret = -EINVAL;
			break;
		}

		if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_sett_save_dnsaddr_enabled(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_sett_save_dnsaddr_enabled(false);
		} else if (link_cmd_args.common_option == LINK_COMMON_NONE && ip_address == NULL) {
			goto show_usage;
		}

		ret = link_setdnsaddr(ip_address ? ip_address : link_sett_dnsaddr_ip_get());

		if (ip_address) {
			link_sett_save_dnsaddr_ip(ip_address);
		}
		break;
	case LINK_CMD_DISCONNECT:
		ret = link_shell_pdn_disconnect(pdn_cid);
		break;
	default:
		mosh_error("Internal error. Unknown link command=%d", link_cmd_args.command);
		ret = -EINVAL;
		break;
	}
	return ret;

show_usage:
	/* Reset getopt for another users: */
	optreset = 1;

	link_shell_print_usage(&link_cmd_args);
	return ret;
}
